app/controllers/add_events_controller.rb

  def index
    @add_events = AddEvent.all
---
SELECT "add_events".* FROM "add_events"

  def create
    @add_event = AddEvent.new(add_event_params)

    respond_to do |format|
      if @add_event.save
---
INSERT INTO "add_events" ("nome_do_event", "local_do_evento", "data_do_evento", "hora_do_event", "descricao_do_evento", "slug", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_add_event
      @add_event = AddEvent.friendly.find(params[:id])
---
SELECT  "add_events".* FROM "add_events" WHERE "add_events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]